In [1]:
import pandas as pd

In [2]:
titanic = pd.read_csv('train.csv')

In [3]:
titanic.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
titanic.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [5]:
titanic = titanic[['Survived', 'Pclass','Sex', 'Age', 'SibSp',
       'Parch', 'Fare', 'Embarked']]

In [6]:
ports = pd.get_dummies(titanic.Embarked,prefix='Embarked')

In [7]:
ports.head(3)

   Embarked_C  Embarked_Q  Embarked_S
0           0           0           1
1           1           0           0
2           0           0           1

In [8]:
titanic

     Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0           0       3    male  22.0      1      0   7.2500        S
1           1       1  female  38.0      1      0  71.2833        C
2           1       3  female  26.0      0      0   7.9250        S
3           1       1  female  35.0      1      0  53.1000        S
4           0       3    male  35.0      0      0   8.0500        S
..        ...     ...     ...   ...    ...    ...      ...      ...
886         0       2    male  27.0      0      0  13.0000        S
887         1       1  female  19.0      0      0  30.0000        S
888         0       3  female   NaN      1      2  23.4500        S
889         1       1    male  26.0      0      0  30.0000        C
890         0       3    male  32.0      0      0   7.7500        Q

[891 rows x 8 columns]

In [9]:
titanic.drop(['Embarked'],axis=1,inplace=True)

In [10]:
titanic

     Survived  Pclass     Sex   Age  SibSp  Parch     Fare
0           0       3    male  22.0      1      0   7.2500
1           1       1  female  38.0      1      0  71.2833
2           1       3  female  26.0      0      0   7.9250
3           1       1  female  35.0      1      0  53.1000
4           0       3    male  35.0      0      0   8.0500
..        ...     ...     ...   ...    ...    ...      ...
886         0       2    male  27.0      0      0  13.0000
887         1       1  female  19.0      0      0  30.0000
888         0       3  female   NaN      1      2  23.4500
889         1       1    male  26.0      0      0  30.0000
890         0       3    male  32.0      0      0   7.7500

[891 rows x 7 columns]

In [11]:
#titanic['Embarked'] = titanic.drop(['Embarked'],axis=1)

In [12]:
titanic.columns

Index(['Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare'], dtype='object')

In [13]:
titanic['Sex'].unique()

array(['male', 'female'], dtype=object)

In [14]:
titanic['Sex'] = titanic.Sex.map({'male':0,'female':1})

In [15]:
titanic.head(3)

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare
0         0       3    0  22.0      1      0   7.2500
1         1       1    1  38.0      1      0  71.2833
2         1       3    1  26.0      0      0   7.9250

In [16]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 7 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Survived  891 non-null    int64
 1   Pclass    891 non-null    int64
 2   Sex       891 non-null    int64
 3   Age       714 non-null    float64
 4   SibSp     891 non-null    int64
 5   Parch     891 non-null    int64
 6   Fare      891 non-null    float64
dtypes: float64(2), int64(5)
memory usage: 48.9 KB

In [17]:
titanic.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
dtype: int64

In [18]:
titanic.Age.fillna(titanic.Age.mean(),inplace=True)

In [19]:
titanic.head(3)

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare
0         0       3    0  22.0      1      0   7.2500
1         1       1    1  38.0      1      0  71.2833
2         1       3    1  26.0      0      0   7.9250

In [20]:
%history

import pandas as pd
titanic = pd.read_csv('train.csv')
titanic.head(5)
titanic.columns
titanic = titanic[['Survived', 'Pclass','Sex', 'Age', 'SibSp',
       'Parch', 'Fare', 'Embarked']]
ports = pd.get_dummies(titanic.Embarked,prefix='Embarked')
ports.head(3)
titanic
titanic.drop(['Embarked'],axis=1,inplace=True)
titanic
#titanic['Embarked'] = titanic.drop(['Embarked'],axis=1)
titanic.columns
titanic['Sex'].unique()
titanic['Sex'] = titanic.Sex.map({'male':0,'female':1})
titanic.head(3)
titanic.info()
titanic.isnull().sum()
titanic.Age.fillna(titanic.Age.mean(),inplace=True)
titanic.head(3)
%history

In [21]:
titanic.columns

Index(['Survived', 'Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare'], dtype='object')

In [22]:
titanic.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
dtype: int64

In [23]:
X = titanic[['Pclass', 'Sex', 'Age', 'SibSp', 'Parch', 'Fare',
       'Embarked_C', 'Embarked_Q', 'Embarked_S']]

KeyError: "['Embarked_Q', 'Embarked_C', 'Embarked_S'] not in index"

In [ ]:
y = titanic[['Survived']]

In [24]:
from sklearn.model_selection import train_test_split

In [25]:
X_train,X_test,y_train,y_test = train_test_split(X,y,train_size=0.80,random_state=123)

NameError: name 'X' is not defined

In [ ]:
from sklearn.linear_model import LogisticRegression

In [ ]:
model1 = LogisticRegression()

In [ ]:
model1.fit(X_train,y_train)

In [ ]:
from sklearn import metrics

In [ ]:
y_pred = pd.Series(model1.predict(X_test))

In [ ]:
y_pred

In [26]:
y_test

NameError: name 'y_test' is not defined

In [27]:
y_test = y_test.reset_index(drop=True)

NameError: name 'y_test' is not defined

In [28]:
y_test

NameError: name 'y_test' is not defined

In [69]:
z1 = pd.concat([y_test,y_pred],axis=1)

In [71]:
z1.columns = ['Actual','Predicted']

In [77]:
z1.head(15)

    Actual  Predicted
0        1          1
1        0          0
2        0          1
3        0          0
4        0          0
5        0          0
6        1          1
7        0          1
8        0          1
9        0          1
10       0          1
11       0          1
12       1          1
13       0          0
14       0          1

In [74]:
model1

LogisticRegression(C=1.0, class_weight=None, dual=False, fit_intercept=True,
          intercept_scaling=1, max_iter=100, multi_class='ovr', n_jobs=1,
          penalty='l2', random_state=None, solver='liblinear', tol=0.0001,
          verbose=0, warm_start=False)

In [73]:
metrics.accuracy_score(y_test,y_pred)

0.8268156424581006

In [ ]:
from sklearn import metrics
y_pred = pd.Series(model.predict(X_test))
y_test = y_test.reset_index(drop=True)
z1 = pd.concat([y_test,y_pred],axis=1)
z1.columns = ['Actual','Predicted']

metrics.accuracy_score(y_test,y_pred)
metrics.precision_score(y_test,y_pred)
metrics.confusion_matrix(y_test,y_pred)

In [75]:
metrics.confusion_matrix(y_test,y_pred)

####

array([[99, 15],
       [16, 49]], dtype=int64)

99 - predicted as 0 and actual as 0
15 - predicted as 1 and actual as 0
16 - predicted as 0 and actual as 1
49 - predicted as 1 and actual as 1

y_test